{
    "Lyrics": [
        [
            "[Intro]",
            "Nobody pray for me",
            "It's been that day for me",
            "Way (Yeah, yeah)",
            "",
            "[Verse 1]",
            "Ayy, I remember syrup sandwiches and crime allowances",
            "Finesse a nigga with some counterfeits, but now I’m countin' this",
            "Parmesan where my accountant lives, in fact I'm downin’ this",
            "D'USSÉ with my boo bae tastes like Kool-Aid for the analysts",
            "Girl, I can buy your ass the world with my paystub",
            "Ooh, that pussy good, won't you sit it on my taste bloods?",
            "I get way too petty once you let me do the extras",
            "Pull up on your block, then break it down: we playin' Tetris",
            "AM to the PM, PM to the AM, funk",
            "Piss out your per diem, you just gotta hate 'em, funk",
            "If I quit your BM, I still ride Mercedes, funk",
            "If I quit this season, I still be the greatest, funk",
            "My left stroke just went viral",
            "Right stroke put lil' baby in a spiral",
            "Soprano C, we like to keep it on a high note",
            "It's levels to it, you and I know",
            "",
            "[Chorus]",
            "Bitch, be humble (Hol' up, bitch)",
            "Sit down (Hol’ up, lil’, hol' up, lil’ bitch)",
            "Be humble (Hol' up, bitch)",
            "Sit down (Hol' up, sit down, lil', sit down, lil’ bitch)",
            "Be humble (Hol' up, hol' up)",
            "Bitch, sit down (Hol' up, hol' up, lil' bitch)",
            "Be humble (Lil' bitch, hol' up, bitch)",
            "Sit down (Hol' up, hol' up, hol' up, hol' up)",
            "Be humble (Hol' up, hol' up)",
            "Sit down (Hol' up, hol' up, lil', hol' up, lil' bitch)",
            "Be humble (Hol' up, bitch)",
            "Sit down (Hol' up, sit down, lil', sit down, lil' bitch)",
            "Be humble (Hol' up, hol' up)",
            "Bitch, sit down (Hol' up, hol' up, lil' bitch)",
            "Be humble (Lil' bitch, hol' up, bitch)",
            "Sit down (Hol' up, hol' up, hol' up, hol' up)",
            "",
            "[Verse 2]",
            "Who that nigga thinkin' that he frontin' on Man-Man? (Man-Man)",
            "Get the fuck off my stage, I'm the Sandman (Sandman)",
            "Get the fuck off my dick, that ain't right",
            "I make a play fucking up your whole life",
            "I'm so fuckin' sick and tired of the Photoshop",
            "Show me somethin' natural like afro on Richard Pryor",
            "Show me somethin' natural like ass with some stretch marks",
            "Still will take you down right on your mama's couch in Polo socks",
            "Ayy, this shit way too crazy, ayy, you do not amaze me, ayy",
            "I blew cool from AC, ayy, Obama just paged me, ayy",
            "I don't fabricate it, ayy, most of y'all be fakin', ayy",
            "I stay modest 'bout it, ayy, she elaborate it, ayy",
            "This that Grey Poupon, that Evian, that TED Talk, ayy",
            "Watch my soul speak, you let the meds talk, ayy",
            "If I kill a nigga, it won't be the alcohol, ayy",
            "I'm the realest nigga after all",
            "",
            "[Chorus]",
            "Bitch, be humble (Hol' up, bitch)",
            "Sit down (Hol' up, lil', hol' up, lil' bitch)",
            "Be humble (Hol' up, bitch)",
            "Sit down (Hol' up, sit down, lil', sit down, lil' bitch)",
            "Be humble (Hol' up, hol' up)",
            "Bitch, sit down (Hol' up, hol' up, lil' bitch)",
            "Be humble (Lil' bitch, hol' up, bitch)",
            "Sit down (Hol' up, hol' up, hol' up, hol' up)",
            "Be humble (Hol' up, hol' up)",
            "Sit down (Hol' up, hol' up, lil', hol' up, lil' bitch)",
            "Be humble (Hol' up, bitch)",
            "Sit down (Hol' up, sit down, lil', sit down, lil' bitch)",
            "Be humble (Hol' up, hol' up)",
            "Bitch, sit down (Hol' up, hol' up, lil' bitch)",
            "Be humble (Lil' bitch, hol' up, bitch)",
            "Sit down (Hol' up, hol' up, hol' up, hol' up)"
        ]
    ],
    "Comments": [
        "On “HUMBLE.” Kendrick Lamar challenges his competition. It was released a week after the first promotional single, “The Heart Part 4,” with a music video directed by Dave Meyers and The Little Homies. It features religious imagery mixed with urban life, such as Kendrick in priest’s robes and a moving re-enactment of Leonardo Da Vinci’s painting The Last Supper—juxtaposing this with the concept of humility in the chorus.",
        "On a religious note, the song could also be a reference to the verse James 4:7.",
        "So humble yourselves before God. Resist the devil, and he will flee from you.\"",
        "—Thus linking to April 7th, the date Kendrick told the industry to have their shit together.",
        "Mike WiLL Made-It produced the beat. It features a deep piano riff and a banging 808 bass line. This style of production is a departure from the sound of Kendrick’s previous jazz-influenced project, To Pimp a Butterfly. It seems to reference the character Deebo’s theme song from the popular comedy movie Friday (1995). Kendrick is also shown riding through the neighborhood on a bicycle in the music video, similar to Deebo in Friday.",
        "The song debuted at No. 2 on the Billboard Hot 100 on April 22, 2017, making it not only the highest charting song for Kendrick, but also one of the highest debuting hip-hop singles since “Love the Way You Lie” by Eminem. The song later hit No. 1 on the chart on June 5, 2017, making it Lamar’s first No. 1 song and second No. 1 song overall on the charts.",
        "Azerbaijan Translation",
        "French Translation",
        "German Translation",
        "Polish Translation",
        "Portuguese Translation",
        "Spanish Translation",
        "Turkish Translation",
        "In the God Is Gangsta extended music video, there is a frame that displays the words, “My taste bloods is expensive.”",
        "About a month after the song’s release, producer Mike WiLL Made-It spoke with NPR about working with Kendrick and how the song came to be, amongst other things:",
        "With “HUMBLE.,” I knew that beat was going to capture a moment. It just felt real urgent. I made that beat [last year] when Gucci Mane was getting out of jail; I made it with him in mind. I was just thinking, damn, Gucci’s about to come home; it’s got to be something urgent that’s just going to take over the radio. And I felt like that beat was that. I ended up not doing it with Gucci and I let Kendrick hear it. I was thinking, if Dot gets on this it’ll be his first time being heard on some[thing] like this. At the same time, it kind of has an NWA/Dr. Dre feel, an Eminem kind of feel. So I thought, let me see if Dot f**** with it. And he heard the beat and he liked it. But he was about to give me “HUMBLE.” for [my album] Ransom 2. I love that song so I was like, ‘Man, hell yeah.’ Then he told me that his team was saying he should keep it. And I told him, ‘Bruh, you definitely should keep it, and you should use it as your single.’",
        "Yes. A week prior to the release of “HUMBLE.” they collaborated on “Perfect Pint,” and back in 2014 they joined forces on “Buy The World.”",
        "The music video was filmed at The McArthur hotel in Los Angeles.",
        "No word from Kendrick but shortly after the music video was released, Dave Free—the president of Kendrick’s record label TDE—posted a tweet that read:",
        "Free can be simply letting the press know he’s unavailable to discuss the video he co-directed. He can be also making a reference to Big Sean’s “No More Interviews” track.",
        "While it’s unconfirmed, Big Sean likely alludes to K. Dot in this line on “No More Interviews”",
        "And I’m just not impressed by you niggas rapping fast",
        "Who sound like one big asthma attack but trash when I’m rapping it back",
        "Who you put in your top five and claim they the savior of rap",
        "Her name is Carter Kim and her instagram is instagram.com/nattybrat",
        "It was the beat first, actually. [Producer] Mike Will sent the beat over. All I could think of was [Marley Marl’s] “The Symphony” and the earliest moments of hip-hop, where it’s complex simplicity, but it’s also somebody making moves. That beat feels like my generation, right now. The first thing that came to my head was, “Be humble.”",
        "via Rolling Stone",
        "Yes, it has been nominated so far for 19 awards and has won 12 of them.",
        "At the MTV Video Awards in 2017, it won a total of 7 awards which includes: Video of the Year, Best Direction, and Best Choreography.",
        "It has also been nominated for 4 awards at the 2018 Grammy Awards and has won 3 of them. These wins include Best Rap Song, Best Rap Performance, and Best Music Video.",
        "This song has a tempo of 150 beats per minute.",
        "No, its based around a minimalist but super-catchy piano sample. You can find more info here.",
        "Ret One (TDE General Manager) – Mackwop (TDE in-house DJ)– Jay Rock (Black Hippy rapper) – Kendrick Lamar – Blue (TDE in-house producer, a.k.a. King Blue) – MixedByAli (TDE in-house recording/mixing engineer) – Sounwave (TDE in-house producer)",
        "Could reference the burning of heretics. With Kendrick front and centre in a white hoodie with ‘Dreamer’ in the top left, he may be presenting himself at the leader of the nonconformist movement in hip-hop. This idea is in a way corroborated by, corroborates, and, in a more general sense strengthens, the potency of the video’s religious theme. The way he fashions his cornrows symbolise either Jewish sideburns or convey in some way a demonic appearance (not associating the two). Whatever the precise symbolism Kendrick had in mind, to say there are no religious connotations would be to force a contrarian point of view; although I’m all for the Devil’s advocate."
    ],
    "Title": "Kendrick Lamar – HUMBLE. Lyrics | Genius Lyrics"
}